nxp-mcuxpresso/mcux-soc-svd/KW47Z420B2/KW47Z420B2.xml
        <register>
          <name>FTEST</name>
          <description>Flash Test Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TMECTL</name>
              <description>Test Mode Entry Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz69</name>
                  <description>FTEST register always reads 0 and writes to FTEST are ignored</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz70</name>
                  <description>FTEST register is readable and can be written to enable writability of TME</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMEWR</name>
              <description>Test Mode Entry Writable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz67</name>
                  <description>TME bit is not writable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz68</name>
                  <description>TME bit is writable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TME</name>
              <description>Test Mode Entry</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz65</name>
                  <description>Test mode entry not requested</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz66</name>
                  <description>Test mode entry requested</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMODE</name>
              <description>Test Mode Status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz63</name>
                  <description>Test mode not active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz64</name>
                  <description>Test mode active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMELOCK</name>
              <description>Test Mode Entry Lock</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz61</name>
                  <description>FTEST register not locked from accepting writes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz62</name>
                  <description>FTEST register locked from accepting writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FCCOB0</name>
          <description>Flash Command Control 0 Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMDCODE</name>
              <description>Command code</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCCOB1</name>
          <description>Flash Command Control 1 Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMDOPT</name>
              <description>Command options</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCCOB2</name>
          <description>Flash Command Control 2 Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMDADDR</name>
              <description>Command starting address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCCOB3</name>
          <description>Flash Command Control 3 Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMDADDRE</name>
              <description>Command ending address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCCOB4</name>
          <description>Flash Command Control 4 Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMDDATA0</name>
              <description>Command data word 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCCOB5</name>
          <description>Flash Command Control 5 Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMDDATA1</name>
              <description>Command data word 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCCOB6</name>
          <description>Flash Command Control 6 Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMDDATA2</name>
              <description>Command data word 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCCOB7</name>
          <description>Flash Command Control 7 Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMDDATA3</name>
              <description>Command data word 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESET_STATUS</name>
          <description>FMU Initialization Tracking Register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ARY_TRIM_DONE</name>
              <description>Array Trim Complete</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz93</name>
                  <description>Recall register load operation has not been completed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz94</name>
                  <description>Recall register load operation has completed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FMU_PARM_EN</name>
              <description>Status of the C0DE_C0DEh check to enable loading of the FMU parameters</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz91</name>
                  <description>C0DE_C0DEh check not attempted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz92</name>
                  <description>C0DE_C0DEh check completed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FMU_PARM_DONE</name>
              <description>FMU Register Load Complete</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz89</name>
                  <description>FMU registers have not been loaded</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz90</name>
                  <description>FMU registers have been loaded</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOC_TRIM_EN</name>
              <description>Status of the C0DE_C0DEh check to enable loading of the SoC trim settings</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz87</name>
                  <description>C0DE_C0DEh check not attempted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz88</name>
                  <description>C0DE_C0DEh check completed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOC_TRIM_ECC</name>
              <description>Status of the C0DE_C0DEh check for enabling ECC decoder during reads of SoC trim settings</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz85</name>
                  <description>C0DE_C0DEh check failed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz86</name>
                  <description>C0DE_C0DEh check passed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOC_TRIM_DONE</name>
              <description>SoC Trim Complete</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz83</name>
                  <description>SoC Trim registers have not been updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz84</name>
                  <description>All SoC Trim registers have been updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RPR_DONE</name>
              <description>Array Repair Complete</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz81</name>
                  <description>Repair registers have not been loaded</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz82</name>
                  <description>Repair registers have been loaded</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INIT_DONE</name>
              <description>Initialization Done</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz79</name>
                  <description>All initialization steps did not complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz80</name>
                  <description>All initialization steps completed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RST_SF_ERR</name>
              <description>ECC Single Fault during Reset Recovery</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz77</name>
                  <description>No single-bit faults detected during initialization</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz78</name>
                  <description>At least one single ECC fault was detected during initialization</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RST_DF_ERR</name>
              <description>ECC Double Fault during Reset Recovery</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz75</name>
                  <description>No double-bit faults detected during initialization</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz76</name>
                  <description>Double-bit ECC fault was detected during initialization</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOC_TRIM_DF_ERR</name>
              <description>ECC Double Fault during load of SoC Trim phrases</description>
              <bitOffset>10</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RST_PATCH_LD</name>
              <description>Reset Patch Required</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz73</name>
                  <description>No patch required to be loaded during reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz74</name>
                  <description>Patch loaded during reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RECALL_DATA_MISMATCH</name>
              <description>Recall Data Mismatch</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz71</name>
                  <description>Data read towards end of reset matched data read for Recall</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz72</name>
                  <description>Data read towards end of reset did not match data read for recall</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
