nxp-mcuxpresso/mcux-soc-svd/KW47Z420B2/KW47Z420B2.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>DWT</name>
      <description>Data Watchpoint and Trace Unit Registers</description>
      <groupName>DWT</groupName>
      <prependToName>DWT_</prependToName>
      <baseAddress>0xE0001000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Control Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFF001</resetMask>
          <fields>
            <field>
              <name>CYCCNTENA</name>
              <description>CYCCNTENA bit. Enables CYCCNT. This bit is UNK/SBZP if the NOCYCCNT bit is RAO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CYCCNTENA_0</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYCCNTENA_1</name>
                  <description>Enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POSTPRESET</name>
              <description>POSTPRESET bits. Reload value for the POSTCNT counter. This field is UNK/SBZP if the NOCYCCNT bit is RAO.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POSTINIT</name>
              <description>POSTINIT bits. Initial value for the POSTCNT counter. This field is UNK/SBZP if the NOCYCCNT bit is RAO.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CYCTAP</name>
              <description>CYCTAP bit. Selects the position of the POSTCNT tap on the CYCCNT counter. This bit is UNK/SBZP if the NOCYCCNT bit is RAO.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CYCTAP_0</name>
                  <description>POSTCNT tap at CYCCNT[6].</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYCTAP_1</name>
                  <description>POSTCNT tap at CYCCNT[10].</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCTAP</name>
              <description>SYNCTAP bits. Selects the position of the synchronization packet counter tap on the CYCCNT counter. This determines the Synchronization packet rate.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYNCTAP_0</name>
                  <description>Disabled. No Synchronization packets.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCTAP_1</name>
                  <description>Synchronization counter tap at CYCCNT[24].</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCTAP_2</name>
                  <description>Synchronization counter tap at CYCCNT[26].</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCTAP_3</name>
                  <description>Synchronization counter tap at CYCCNT[28].</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PCSAMPLENA</name>
              <description>PCSAMPLENA bit. Enables use of POSTCNT counter as a timer for Periodic PC sample packet generation. This bit is UNK/SBZP if the NOTRCPKT bit is RAO or the NOCYCCNT bit is RAO.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PCSAMPLENA_0</name>
                  <description>No Periodic PC sample packets generated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCSAMPLENA_1</name>
                  <description>Periodic PC sample packets generated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXCTRCENA</name>
              <description>EXCTRCENA bit. Enables generation of exception trace. This bit is UNK/SBZP if the NOTRCPKT bit is RAO.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXCTRCENA_0</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXCTRCENA_1</name>
                  <description>Enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPIEVTENA</name>
              <description>CPIEVTENA bit. Enables generation of the CPI counter overflow event. This bit is UNK/SBZP if the NOPRFCNT bit is RAO.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPIEVTENA_0</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPIEVTENA_1</name>
                  <description>Enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXCEVTENA</name>
              <description>EXCEVTENA bit. Enables generation of the Exception overhead counter overflow event. This bit is UNK/SBZP if the NOPRFCNT bit is RAO.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXCEVTENA_0</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXCEVTENA_1</name>
                  <description>Enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLEEPEVTENA</name>
              <description>SLEEPEVTENA bit. Enables generation of the Sleep counter overflow event. This bit is UNK/SBZP if the NOPRFCNT bit is RAO.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLEEPEVTENA_0</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLEEPEVTENA_1</name>
                  <description>Enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LSUEVTENA</name>
              <description>LSUEVTENA bit. Enables generation of the LSU counter overflow event. This bit is UNK/SBZP if the NOPRFCNT bit is RAO.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LSUEVTENA_0</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSUEVTENA_1</name>
                  <description>Enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FOLDEVTENA</name>
              <description>FOLDEVTENA bit. Enables generation of the Folded-instruction counter overflow event. This bit is UNK/SBZP if the NOPRFCNT bit is RAO.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FOLDEVTENA_0</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOLDEVTENA_1</name>
                  <description>Enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CYCEVTENA</name>
              <description>CYCEVTENA bit. Enables POSTCNT underflow Event counter packets generation. This bit is UNK/SBZP if the NOTRCPKT bit is RAO or the NOCYCCNT bit is RAO.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CYCEVTENA_0</name>
                  <description>No POSTCNT underflow packets generated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYCEVTENA_1</name>
                  <description>POSTCNT underflow packets generated, if PCSAMPLENA set to 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NOPFRCNT</name>
              <description>NOPFRCNT bit. Shows whether the implementation supports the profiling counters.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOPFRCNT_0</name>
                  <description>Supported.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOPFRCNT_1</name>
                  <description>Not supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NOCYCCNT</name>
              <description>NOCYCCNT bit. Shows whether the implementation supports a cycle counter.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOCYCCNT_0</name>
                  <description>Cycle counter supported.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOCYCCNT_1</name>
                  <description>Cycle counter not supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NOEXTTRIG</name>
              <description>NOEXTRRIG bit. Shows whether the implementation includes external match signals, CMPMATCH[N].</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOEXTTRIG_0</name>
                  <description>CMPMATCH[N] supported.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOEXTTRIG_1</name>
                  <description>CMPMATCH[N] not supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NOTRCPKT</name>
              <description>NOTRCPKT bit. Shows whether the implementation supports trace sampling and exception tracing. If this bit is RAZ, the NOCYCCNT bit must also RAZ.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTRCPKT_0</name>
                  <description>Trace sampling and exception tracing supported.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTRCPKT_1</name>
                  <description>Trace sampling and exception tracing not supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NUMCOMP</name>
              <description>NUMCOMP bits. Number of comparators implemented. A value of zero indicates no comparator support.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CYCCNT</name>
          <description>Cycle Count Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CYCCNT</name>
              <description>CYCCNT[31:0]. Incrementing cycle counter value. When enabled, CYCCNT increments on each processor clock cycle. On overflow, CYCCNT wraps to zero.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPICNT</name>
          <description>CPI Count Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPICNT</name>
              <description>CPICNT[7:0]. The base CPI counter. Counts additional cycles required to execute multi-cycle instructions, except those recorded by DWT_LSUCNT, and counts any instruction fetch stalls.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXCCNT</name>
          <description>Exception Overhead Count Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXCCNT</name>
              <description>EXCCNT[7:0]. The exception overhead counter. Counts the total cycles spent in exception processing.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLEEPCNT</name>
          <description>Sleep Count Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SLEEPCNT</name>
              <description>SLEEPCNT[7:0]. Sleep counter. Counts the total number of cycles that the processor is sleeping.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LSUCNT</name>
          <description>LSU Count Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LSUCNT</name>
              <description>LSUCNT[7:0]. Load-store counter. Increments on any additional cycles required to execute load or store instructions.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FOLDCNT</name>
          <description>Folded-instruction Count Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FOLDCNT</name>
              <description>FOLDCNT[7:0]. Folded-instruction counter. Increments on each instruction that takes 0 cycles.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCSR</name>
          <description>Program Counter Sample Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>EIASAMPLE</name>
              <description>EIASAMPLE[31:0]. Executed Instruction Address sample value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP0</name>
          <description>Comparator Register 0</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COMP</name>
              <description>COMP[31:0]. Reference value for comparison.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK0</name>
          <description>Mask Register 0</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MASK</name>
              <description>MASK[4:0]. The size of the ignore mask, 0-31 bits, applied to address range matching. The maximum mask size is IMPLEMENTATION DEFINED. A debugger can write 0b11111 to this field and then read the register back to determine the maximum mask size supported.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
